<?php

//"" => "";

$que[0] = array(
    "0" => "привет";
    "1" => "приветик";
    "2" => "прив";
    "3" => "здорова";
    "4" => "здарова";
    "5" => "дороу";
    "6" => "дратути";
    "7" => "хай";
    "8" => "хаюшки";
)

$ans[0] = array(
    "0" => "Привет-привет, {$user_name}!";
    "1" => "О, {$user_name}! Приветик!";
    "2" => "Дороу, {$user_name}!";
)

/*$que[] = array(
    "0" => "";
    "1" => "";
    "2" => "";
    "3" => "";
    "4" => "";
    "5" => "";
    "6" => "";
    "7" => "";
    "8" => "";
    "9" => "";
    "10" => "";
)
*/